app/controllers/decrypt_messages_controller.rb

	def create
		#params[:message] = {"content" => message_hash["message"]} ?
		#message = DecryptMessage.create(message_params)

		message = DecryptMessage.new()

		message.content = params[:message]

		key = Key.find(params[:id])

		rsa = RSA.new(key.n, key.e, key.d)

		message.content = rsa.decrypt(message.content)

		respond_to do |format|
			if message.save
---
SELECT  "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
INSERT INTO "decrypt_messages" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-12-19 21:42:38.104667"], ["updated_at", "2017-12-19 21:42:38.104667"]]