app/controllers/encrypt_messages_controller.rb

SELECT  "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
INSERT INTO "encrypt_messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "\"TUES\""], ["created_at", "2017-12-19 19:20:26.219483"], ["updated_at", "2017-12-19 19:20:26.219483"]]
---
	def create
		#params[:message] = {"content" => message_hash["message"]} ?
		#message = EncryptMessage.create(message_params)

		message = EncryptMessage.new()

		message.content = params[:message]

		key = Key.find(params[:id])

		rsa = RSA.new(key.n, key.e, key.d)

		message.content = rsa.encrypt(message.content)

		respond_to do |format|
			if message.save

SELECT  "encrypt_messages".* FROM "encrypt_messages" WHERE "encrypt_messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
    message = EncryptMessage.find(params[:id])