app/controllers/keys_controller.rb

INSERT INTO "keys" ("n", "e", "d", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["n", 24553], ["e", 65537], ["d", 3113], ["created_at", "2017-12-19 17:03:07.408684"], ["updated_at", "2017-12-19 17:03:07.408684"]]
---
	def create
		key = Key.new()

		if(params.has_key?(:n) && params.has_key?(:e) && params.has_key?(:d))
			key.n = params[:n]
			key.e = params[:e]
			key.d = params[:d]
		else
			keyParams = RSA.new(0, 0, 0).new_key

			key.n = keyParams[0]
			key.e = keyParams[1]
			key.d = keyParams[2]
 		end

		respond_to do |format|
			if key.save

SELECT  "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
	def show
    key = Key.find(params[:id])